app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 22 Aug 2013 08:51:48 UTC +00:00], ["name", "slackline"], ["updated_at", Thu, 22 Aug 2013 08:51:48 UTC +00:00]]
---
	def create
		@category = Category.new(params.require(:category).permit(:name))

		if @category.save