app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'slacklines' LIMIT 1
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Cool"], ["created_at", Sat, 24 Aug 2013 01:33:12 UTC +00:00], ["post_id", 1], ["updated_at", Sat, 24 Aug 2013 01:33:12 UTC +00:00], ["user_id", 3]]
---
  def create
   @post = Post.find_by(slug: params[:post_id])
   @comment = Comment.new(params.require(:comment).permit(:body))
   @comment.post = @post
   @comment.creator = current_user

   if @comment.save