app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "slug", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 29 Aug 2013 21:17:02 UTC +00:00], ["slug", "slacklines"], ["title", "slacklines"], ["updated_at", Thu, 29 Aug 2013 21:17:02 UTC +00:00], ["url", "test"]]
---
  def create

    @post = Post.new(post_params)


    if @post.save

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 27 Aug 2013 20:56:00 UTC +00:00], ["updated_at", Tue, 27 Aug 2013 20:56:00 UTC +00:00], ["user_id", 1], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
  def vote
    Vote.create(voteable: @post, creator: current_user, vote: params[:vote])