app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?)
---
	def create
		@user = User.new(users_params)

		if @user.save